#pragma once

/* ==== STRUCTS ===================*/
struct RefdefView {
	Vector2 tanHalfFov;		// 0x00
	uint8_t unk1[0xC];		// 0x08
	Vector3 axis[3];      // 0x14
};

struct refdef_t {
	int x;           // 0x00
	int y;           // 0x04
	int width;       // 0x08
	int height;      // 0x0C
	RefdefView view; // 0x10
};

struct refdefKeyStruct
{
	DWORD ref0; // 0x00
	DWORD ref1; // 0x04
	DWORD ref2; // 0x08
};

struct NameEntry {
	uint32_t idx;
	char name[0x24];
	uint8_t unk1[0x64];
	uint32_t health;
};
/* =================================*/


bool is_bad_ptr(void* adr) { return adr == nullptr; }
namespace utils {
	
	void log(const char* str) {
		std::cout << str << std::endl;
	}
	void loghex(const char* str, uint64_t val) {
		std::cout << str << std::hex << val << std::endl;
	}
}


namespace offsets {
	constexpr auto Camera_Base = 0x14417F80; // ok

	constexpr auto Camera_Pos = 0x1D8; // ok

	constexpr auto CLIENT_INFO = 0x17219218; // ok

	constexpr auto CLIENT_BASE = 0x9DBF8; // ok

	constexpr auto Ref_Def = 0x1721BBB0; // ok

	constexpr auto Dead_1 = 0x64BD;// ok

	constexpr auto Dead_2 = 0x7FB0;// ok

	constexpr auto Player_Pos_Info = 0x448; // ok

	constexpr auto Player_Size = 0x3AA8; // ok

	constexpr auto Player_Team = 0x2DF4; // ok

	constexpr auto Player_Valid = 0x488; // ok

